       IDENTIFICATION DIVISION.                                  
       PROGRAM-ID. PGM26.                                        
       ENVIRONMENT DIVISION.                                     
       INPUT-OUTPUT SECTION.                                     
       FILE-CONTROL.                                             
            SELECT EMPINFILE ASSIGN TO INFILE       >>INPUT FILE 
                           STATUS EMP-IN-STAT.                   
            SELECT EMPOUTFILE ASSIGN TO OTFILE                   
                           STATUS EMP-OUT-STAT.                  
       DATA DIVISION.                                            
       FILE SECTION.                                             
       FD EMPINFILE.                                             
          01 EMP-REC.                                            
             05 EMP-ID PIC X(5).                                 
             05 EMP-FIRST PIC X(25).                             
             05 EMP-LAST PIC X(25).                              
              05 EMP-DEPT PIC X(4).                  
              05 EMP-BASIC PIC X(6).                 
              05 EMP-CCA PIC X(5).                   
        FD EMPOUTFILE.                               
           01 EMP-OUT-REC PIC X(70).                 
        WORKING-STORAGE SECTION.                     
        77 EMP-IN-STAT PIC XX.                       
        77 EMP-OUT-STAT PIC XX.                      
        77 CLEANUP PIC S9(9) COMP.                   
        77 ABCODE PIC S9(9) COMP.                    
        77 EOF-INPUT PIC X VALUE 'N'.                
        PROCEDURE DIVISION.                          
        0001-START.                                  
             PERFORM 1000-INIT THRU 1000-EXIT.       
             PERFORM 2000-COPY-REC THRU 2000-EXIT    
                     UNTIL EOF-INPUT = 'Y'.          
             PERFORM 6000-EOJ THRU 6000-EXIT.        
            GOBACK.                                       
       1000-INIT.                                         
            OPEN INPUT EMPINFILE.                         
            IF EMP-IN-STAT NOT = '00'                     
                  DISPLAY 'ERROR WHILE OPENING YOUR FILE' 
                  EMP-IN-STAT                             
                  MOVE 1111 TO ABCODE                     
                  PERFORM 9000-ABEND                      
            END-IF.                                       
            OPEN OUTPUT EMPOUTFILE.                       
            IF EMP-OUT-STAT NOT = '00'                    
                  DISPLAY 'ERROR WHILE OPENING YOUR FILE' 
                  EMP-OUT-STAT                            
                  MOVE 1111 TO ABCODE                     
                  PERFORM 9000-ABEND                      
            END-IF.                                       
       1000-EXIT.                                         
            EXIT.                                      
       2000-COPY-REC.                                  
             PERFORM 3000-READ-INPUT THRU 3000-EXIT.   
             IF EOF-INPUT = 'N'                        
                  PERFORM 4000-PROCESS-OUTPUT THRU     
                          4000-EXIT                    
             END-IF.                                   
       2000-EXIT.                                      
             EXIT.                                     
       3000-READ-INPUT.                                
           READ EMPINFILE.                             
           EVALUATE EMP-IN-STAT                        
                    WHEN '00'                          
                        CONTINUE                       
                    WHEN '10'                          
                        MOVE 'Y' TO EOF-INPUT          
                    WHEN OTHER                         
                        MOVE 2222 TO ABCODE      
                        PERFORM 9000-ABEND       
           END-EVALUATE.                         
       3000-EXIT.                                
            EXIT.                                
       4000-PROCESS-OUTPUT.                      
           WRITE EMP-OUT-REC FROM EMP-REC.       
       4000-EXIT.                                
           EXIT.                                 
       6000-EOJ.                                 
            CLOSE EMPINFILE.                     
            CLOSE EMPOUTFILE.                    
       6000-EXIT.                                
            EXIT.                                
       9000-ABEND.                               
           MOVE 0 TO CLEANUP.                    
           CALL 'CEE3ABD' USING ABCODE CLEANUP.  